Revit 2026 API

# ToggleButtonData(String, String) Constructor

---

Constructs a new instance of ToggleButtonData, where the ToggleButton will not be associated to an ExternalCommand.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ToggleButtonData(
	string name,
	string text
)
```
```vb
Public Sub New (
	name As String,
	text As String
)
```
```cpp
public:
ToggleButtonData(
	String^ name,
	String^ text
)
```
```fsharp
new :
        name : string *
        text : string -> ToggleButtonData
```

#### Parameters

name String
    The internal name of the new button.
text String
    The user visible text seen on the new button.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when  is passed for one or more arguments. |
| ArgumentException | Thrown when an empty string is passed for one or more arguments. |

#### Reference

ToggleButtonData Class

ToggleButtonData Overload

Autodesk.Revit.UI Namespace